/*==================================================================================================

	デバッグフォントモジュール[debug_font.h]
																					Author:
																					Date  :
----------------------------------------------------------------------------------------------------

===================================================================================================*/
#pragma once
#ifndef DEBUG_FONT_H
#define DEBUG_FONT_H

//デバッグフォントモジュールの初期化
void DebugFont_Initialize(void);

//デバッグフォントモジュールの終了処理
void DebugFont_Finalize(void);

//デバッグフォントの表示
//
//引数：dx,dy    デバッグ文字列への描画座標
//      pSting   デバッグ文字列へのポインタ
//
void DebugFont_Draw(float dx, float dy, const char* pString);

#endif // !DEBUG_FONT_H
