/*==================================================================================================

	ÉQÅ[ÉÄÇÃìGêßå‰[game_enemy.cpp]
																					Author:
																					Date  :
----------------------------------------------------------------------------------------------------

===================================================================================================*/
#ifndef GAME_JUDGMENT_H
#define GAME_JUDGMENT_H

void GameJudgment_Initialize(void);
void GameJudgment_Update(void);
#endif // !GAME_JUDGMENT_H
