/*==================================================================================================

	xz平面グリッド描画[grid.h]
																					Author:
																					Date  :
----------------------------------------------------------------------------------------------------

===================================================================================================*/
#ifndef GRID_H_
#define GRID_H_

#include<d3d9.h>

//
//size グリッドのサイズ
//count　一辺のグリッド数
//color　グリッドのカラー
void Grid_Initialize(float size,int count, D3DCOLOR color);

void Grid_Finalize(void);

void Grid_Draw(void);
#endif // !GRID_H_
