/*==================================================================================================

	メッシュフィールド描画[meshfield.h]
																					Author:
																					Date  :2020/10/09
----------------------------------------------------------------------------------------------------

===================================================================================================*/
#ifndef MESH_FIELD_H_
#define MESH_FIELD_H_


void MeshField_Initialize(int xx,int yy);
void MeshField_Finalize(void);
void MeshField_Draw(void);

#endif